In [10]:
import pandas as pd
from sklearn.feature_extraction.text import TfidfVectorizer
from sklearn.metrics.pairwise import cosine_similarity

## Data Loading

In [3]:
user_df = pd.read_csv("users_synthesized.csv", converters={"Travel_Preference": eval, "Visited_Places": eval})
place_df = pd.read_csv("tourism_place_synthesized.csv", converters={"Tags": eval})

In [4]:
user_df.head()

,Unnamed: 0,User_Id,Location,Age,Visited_Places,Travel_Preference
0,0,1,"Semarang, Jawa Tengah",20,"[379, 155, 372]","[pok, kreo, ngupasan, mata]"
1,1,2,"Bekasi, Jawa Barat",21,"[117, 102, 398, 106]","[pecinan, rajin, grote, masa]"
2,2,3,"Cirebon, Jawa Barat",23,"[170, 383, 101, 373, 130]","[binatang, teras, loket, drini]"
3,3,4,"Bekasi, Jawa Barat",21,"[315, 301, 316]","[honda, north, cibodas, kwan]"
4,4,5,"Lampung, Sumatera Selatan",20,"[356, 233]","[tebing, simulasi, glodok, geoforest]"

In [5]:
user_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 300 entries, 0 to 299
Data columns (total 6 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Unnamed: 0         300 non-null    int64
 1   User_Id            300 non-null    int64
 2   Location           300 non-null    object
 3   Age                300 non-null    int64
 4   Visited_Places     300 non-null    object
 5   Travel_Preference  300 non-null    object
dtypes: int64(3), object(3)
memory usage: 14.2+ KB

In [6]:
place_df.head()

,Unnamed: 0,Place_Id,Place_Name,Description,Category,City,Price,Rating,Coordinate,Lat,Long,Tags,Clean_Description
0,0,1,Monumen Nasional,Monumen Nasional atau yang populer disingkat d...,Budaya,Jakarta,20000,4.6,"{'lat': -6.1753924, 'lng': 106.8271528}",-617.539,1.068.272,"[monumen, monas, tugu]",monumen nasional populer singkat monas tugu mo...
1,1,2,Kota Tua,"Kota tua di Jakarta, yang juga bernama Kota Tu...",Budaya,Jakarta,0,4.6,"{'lat': -6.137644799999999, 'lng': 106.8171245}",-613.764,1.068.171,"[alunalun, tua, mi]",kota tua jakarta nama kota tua pusat alunalun ...
2,2,3,Dunia Fantasi,Dunia Fantasi atau disebut juga Dufan adalah t...,Taman Hiburan,Jakarta,270000,4.6,"{'lat': -6.125312399999999, 'lng': 106.8335377}",-612.531,1.068.335,"[dufan, fantasi, 1985]",dunia fantasi sebut dufan tempat hibur letak k...
3,3,4,Taman Mini Indonesia Indah (TMII),Taman Mini Indonesia Indah merupakan suatu kaw...,Taman Hiburan,Jakarta,10000,4.5,"{'lat': -6.302445899999999, 'lng': 106.8951559}",-630.245,1.068.952,"[ls106, 68, 53]",taman mini indonesia indah rupa suatu kawasan ...
4,4,5,Atlantis Water Adventure,Atlantis Water Adventure atau dikenal dengan A...,Taman Hiburan,Jakarta,94000,4.5,"{'lat': -6.12419, 'lng': 106.839134}",-612.419,1.068.391,"[atlantis, tualang, ancol]",atlantis water adventure kenal atlantis ancol ...

In [7]:
place_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 437 entries, 0 to 436
Data columns (total 13 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Unnamed: 0         437 non-null    int64
 1   Place_Id           437 non-null    int64
 2   Place_Name         437 non-null    object
 3   Description        437 non-null    object
 4   Category           437 non-null    object
 5   City               437 non-null    object
 6   Price              437 non-null    int64
 7   Rating             437 non-null    float64
 8   Coordinate         437 non-null    object
 9   Lat                437 non-null    float64
 10  Long               437 non-null    object
 11  Tags               437 non-null    object
 12  Clean_Description  437 non-null    object
dtypes: float64(2), int64(3), object(8)
memory usage: 44.5+ KB

## Building